# Dotfiles management
brew "stow"

# File & search tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "tree"

# Git tools
brew "git"
brew "git-delta"
brew "git-machete"
brew "gitingest"
brew "tig"

# System monitoring
brew "btop"
brew "topgrade"  # Universal package updater

# Development tools
# brew "composer"  # Not needed - bundled with Herd
brew "curl"
brew "jq"
brew "jrnl"
brew "mailpit", restart_service: :changed
brew "neovim"
brew "terminal-notifier"
brew "wget"
brew "xz"

# Python
brew "pyenv"

# Shell enhancements
brew "starship"
brew "thefuck"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts (for Starship and terminal)
cask "font-jetbrains-mono-nerd-font"

# macOS-specific tools (auto-skipped on Linux)
brew "dockutil" if OS.mac?
brew "duti" if OS.mac?
